import React from "react";

export default function PrivacyPolicyText() {
  return (
    <div style={{ fontSize: "0.9rem", whiteSpace: "pre-line" }}>
      <p>Настоящая Политика конфиденциальности описывает политику и процедуры, принятые ЗАО «ТРЕНДСЕТТЕР» относительно сбора, использования и раскрытия информации о клиентах при использовании предлагаемых ЗАО «ТРЕНДСЕТТЕР» услуг и сайта, определяя права клиента на конфиденциальность информации и правовые нормы по защите этих прав.</p>

      <p>При получении доступа к Сайту Общества и/или при использовании доступных на Сайте инструментов или Услуг, Пользователь выражает свое безоговорочное согласие с условиями, изложенными в настоящей политике конфиденциальности.</p>

      <h3>1. Определения</h3>
      <p>1.1. В рамках настоящей Политики конфиденциальности приведенные ниже термины имеют следующее значение:</p>
      <ul>
        <li>Пользователь/клиент: физическое лицо, которое пользуется Сайтом Общества или предлагаемой Обществом какой-либо услугой или обратился в Общество или каким-то иным образом выразило намерение воспользоваться Услугами Общества, включая также общество или иное юридическое лицо, от имени которого физическое лицо действует с целью пользования Услугами.</li>
        <li>Общество: ЗАО «ТРЕНДСЕТТЕР» (РА, Ереван, Е.Кохбаци 36/4).</li>
        <li>Сайт: Официальный сайт Общества – https://www.trendsetteramultibrand.com</li>
        <li>Страна: Армения</li>
        <li>Устройство: означает любое устройство, с помощью которого Вы можете войти в приложение, например в компьютер, мобильный телефон или цифровой планшет.</li>
        <li>Личные данные: любая информация, относящаяся к идентифицированному или идентифицируемому лицу,</li>
        <li>Услуги: любая услуга, предлагаемая Обществом на условиях, опубликованных на Сайте, включая куплю-продажу, доставку товаров и прочее.</li>
      </ul>

      <h3>2. СБОР И ИСПОЛЬЗОВАНИЕ ЛИЧНЫХ ДАННЫХ</h3>
      <p>2.1. Для пользования Услугами (сайтом) от Пользователя может потребоваться предоставление некоторых личных данных, которые могут быть использованы для установления связи с Пользователем или его идентификации. Личные данные могут включать, но не ограничиваясь следующими данными:</p>
      <ul>
        <li>Имя и фамилия,</li>
        <li>Номер телефона,</li>
        <li>Адрес, страна, штат, ZIP/почтовый индекс, город,</li>
        <li>Электронный адрес,</li>
        <li>Пол, возраст, паспортные данные.</li>
      </ul>
      <p>2.2. Сбор сведений осуществляется в процессе использования Пользователем Сайта.</p>
      <p>2.3. Кроме личных данных, с целью обеспечения надлежащей работы и предоставления Услуг осуществляет также сбор данных для использования, которые могут включать такие сведения, как интернет-адрес Устройства (к примеру адрес IP), тип браузера /browser/, вариант браузера, страницы Услуг, которые Пользователь посещает, время и дату посещения, время проведенное на этих страницах, идентификаторы данного устройства /identifiers/, имя пользователя для Системы и другие отличительные данные.</p>

      <p>2.4. Цели использования личных данных. Общество может использовать Личные данные для следующих целей:</p>
      <ul>
        <li>с целью предоставления Услуг, также для осуществления контроля за использованием Услуг (Сайта),</li>
        <li>для управления учетной записью, регистрируясь как пользователь системы,</li>
        <li>для установления связи с Пользователем посредством электронной почты, телефонных звонков, коротких сообщений (SMS) или другими аналогичными способами электронного сообщения, такими как уведомления Приложений (push), с целью обмена информации, касающейся обновлений функций, товаров или договорных услуг, включая при необходимости обновления с целью безопасности,</li>
        <li>для предоставления новостей, специальных предложений и общей информации относительно предлагаемых Пользователем продуктов, Услуг и событий, в частности по тем продуктам,</li>
        <li>для обратной связи по запросам, направленным в Общество и контроля за этим,</li>
        <li>для прочих целей. Информация может быть использована для прочих целей, таких, как анализ данных, выявление тенденций использования, для определения эффективности наших рекламных ходов и оценки Услуг, а также опыта использования Услуг и его улучшения.</li>
      </ul>

      <p>2.5. Передача личных данных. Пользователь дает безоговорочное право передачи своих личных данных в случаях, предусмотренных настоящей политикой конфиденциальности. Личные данные могут быть переданы в следующих случаях:</p>
      <ul>
        <li>лицам, предоставляющим Обществу услуги — для осуществления контроля и анализа использования Услуг, а также для установления связи с Вами,</li>
        <li>партнерам Общества для представления Пользователю некоторых товаров, услуг или рекламных предложений, для статистических данных или других целей,</li>
        <li>с Вашего согласия мы можем обнародовать/передать Ваши личные данные любым иным способом.</li>
      </ul>

      <p>2.6. Хранение личных данных. Общество хранит Личные данные до тех пор, пока это необходимо для реализации целей, установленных Политикой конфиденциальности. Личные данные будут храниться и использоваться в том объеме, в котором это необходимо для разрешения споров по исполнению обязательств Общества и реализации правовых соглашений и политики в случаях, установленных и предусмотренных законом РА «О защите личных данных» (далее также – «Закон»).</p>

      <p>2.7. Обработка личных данных. Обработка личных данных осуществляется в операционных офисах Общества и в любых других местах, где находятся стороны, участвующие в обработке личных данных. Это означает, что данная информация может передаваться и храниться на компьютерах, расположенных за пределами вашей страны, штата, области или иной государственной компетенции, где законы о защите данных могут отличаться от законов Вашей страны. Соглашаясь с настоящей Политикой конфиденциальности с последующим предоставлением такой ​​информации, Вы также даете согласие на такую ​​передачу. Общество обязуется предпринять все необходимые меры для обеспечения безопасности Ваших данных в соответствии с настоящей Политикой конфиденциальности, а также гарантирует, что Ваши Личные данные не будут переданы другой организации или стране без обеспечения соответствующего контроля и безопасности.</p>

      <p>2.8. Пользователь вправе удалить/обновить или потребовать от Общества удалить/обновить Личные данные, собранные о Пользователе. Одновременно, в случаях, предусмотренных законом, некоторые виды информации не подлежат удалению.</p>

      <p>2.10. Защита Личных данных. Общество гарантирует, что примет все необходимые меры в целях обеспечения безопасности личных данных. Однако Общество не гарантирует их абсолютную безопасность. Личные данные всегда находятся в защищенных сетях, они доступны лишь для ограниченного круга лиц, имеющих специальные права доступа к указанным системам и обязанных сохранять конфиденциальность указанных данных и сведений в порядке, установленном законодательством. Общество не несет какой-либо ответственности за утечку или разглашение личных данных, не предусмотренных законом или настоящей политикой.</p>

      <p>2.11. Сайт может содержать ссылки на сторонние веб-ресурсы, не находящиеся под контролем Общества. При переходе Пользователя по таким ссылкам Пользователь покидает настоящий Сайт и переходит на ресурс третьей стороны. Общество не осуществляет контроль над содержанием, политиками конфиденциальности или практиками защиты данных, применяемыми на сторонних ресурсах, и не несет за них ответственность. Рекомендуем Пользователям ознакомиться с политикой конфиденциальности каждого стороннего сайта, который они посещают.</p>

      <p>2․12․ HTTP «cookies» (также называемые веб-cookie (куки)) представляют собой небольшие блоки данных, которые создаются веб-сервером, когда Пользователь просматривает сайт, и позволяют Сайту распознавать браузер Пользователя и запоминать определенную информацию, включая количество посещений. С помощью такой информации Общество может выявлять предпочтения Пользователя на основании предыдущих или текущих действий.</p>

      <h3>3. Внесение изменений в настоящую политику конфиденциальности</h3>
      <p>Изменения и/или дополнения в Политику конфиденциальности осуществляются Обществом в одностороннем порядке. Внесенные изменения публикуются на Сайте. Пользователи считаются уведомленными об изменениях с момента публикации на Сайте.</p>
    </div>
  );
}
