import React from "react";

export default function PrivacyPolicyText() {
  return (
    <div style={{ fontSize: "0.9rem", whiteSpace: "pre-line" }}>
      <p>Սույն Գաղտնիության քաղաքականությունը նկարագրում է «ՏՐԵՆԴՍԵՏՏԵՐ» ՓԲԸ-ի կողմից առաջարկվող ծառայություններից և կայքից օգտվելիս հաճախորդի տեղեկատվության հավաքագրման, օգտագործման և բացահայտման գծով «ՏՐԵՆԴՍԵՏՏԵՐ» ՓԲԸ որդեգրած քաղաքականությունն ու ընթացակարգերը՝ սահմանելով տեղեկատվության գաղտնիության հաճախորդի իրավունքները և այդ իրավունքների պաշտպանության իրավական կարգավորումները:</p>

      <p>Մուտք գործելով Ընկերության Կայք և/կամ օգտվելով Կայքում առկա գործիքակազմից կամ Ծառայություններից՝ Օգտագործողը տալիս է իր անվերապահ համաձայնությունը սույն գաղտնիության քաղաքականությամբ բերված պայմաններին։</p>

      <h3>1. Սահմանումներ</h3>
      <p>1.1 Սույն Գաղտնիության քաղաքականության շրջանակներում ստորև բերված հասկացությունները ունեն հետևյալ իմաստը՝</p>
      <ul>
        <li>Օգտագործող/հաճախորդ` ֆիզիկական անձ, ով օգտվում է Ընկերության Կայքից կամ Ընկերության կողմից առաջարկվող որևէ Ծառայությունից կամ դիմել է Ընկերությանն կամ որևէ կերպ մտադրություն է հայտնել Ընկերության Ծառայություններից օգտվելու համար, ներառյալ նաև ընկերությունը կամ այլ իրավաբանական անձ, որի անունից այդ ֆիզիկական անձը գործում է՝ Ծառայություններից օգտվելու համար։</li>
        <li>Ընկերություն՝ «ՏՐԵՆԴՍԵՏՏԵՐ» ՓԲԸ (ՀՀ, Երևան, Ե. Կողբացու 36/4):</li>
        <li>Կայք՝ Ընկերության պաշտոնական կայքը` https://www.trendsetteramultibrand.com</li>
        <li>Երկիրը՝ Հայաստան</li>
        <li>Սարք՝ նշանակում է ցանկացած սարք, որի միջոցով Դուք կարող եք մուտք գործել հավելված, օրինակ համակարգիչ, բջջային հեռախոս կամ թվային պլանշետ</li>
        <li>Անձնական տվյալներ՝ ցանկացած տեղեկություն, որը վերաբերում է նույնականացված կամ նույնականացվող անձին</li>
        <li>Ծառայություններ՝ Ընկերության կողմից առաջարկվող և Կայքում հրապարակված պայմաններով ցանկացած ծառայություն, ներառյալ՝ ապրանքների առուվաճառք, առաքում և այլն</li>
      </ul>

      <h3>2. ԱՆՁՆԱԿԱՆ ՏՎՅԱԼՆԵՐԻ ՀԱՎԱՔԱԳՐՈՒՄԸ ԵՎ ՕԳՏԱԳՈՐԾՈՒՄԸ</h3>
      <p>2.1 Ծառայություններից (կայքից) օգտվելու համար Օգտագործողից կարող է պահանջվել տրամադրել որոշակի անձնական տվյալներ, որոնք կարող են օգտագործվել Օգտագործողի հետ կապ հաստատելու կամ նույնականացնելու համար։ Անձնական տվյալները կարող են ներառել, բայց չսահմանափակվել հետևյալ տվյալներով՝</p>
      <ul>
        <li>Անուն և ազգանուն,</li>
        <li>Հեռախոսահամար,</li>
        <li>Հասցե, երկիր, նահանգ, ZIP/փոստային ինդեքս, քաղաք,</li>
        <li>Էլեկտրոնային հասցե,</li>
        <li>Սեռ, տարիք, անձնագրային տվյալներ։</li>
      </ul>

      <p>2․2 Տեղեկությունները հավաքագրվում Օգտագործողի՝ Կայքից օգտվելու ընթացքում։</p>
      <p>2․3 Բացի Անձնական տվյալներից, Ընկերությունը Կայքի պատշաճ աշխատանքը և Ծառայությունների մատուցումը ապահովելու նպատակով հավաքագրում է նաև օգտագործման տվյալները, որոնք կարող են ներառել այնպիսի տեղեկություններ, ինչպիսիք են Սարքի ինտերնետային հասցեն (օրինակ՝ IP հասցեն), դիտարկիչի /browser/ տեսակը, դիտարկիչի տարբերակը, Ծառայության այն էջերը, որոնք Օգտագործողը այցելում է, այցելության ժամը և ամսաթիվը, այդ էջերում անցկացրած ժամանակը, տվյալ սարքի նույնացուցիչները /identifiers/, Համակարգերից օգտվելու համար մուտքանունը և այլ տարբերակիչ տվյալներ։</p>

      <p>2.4 Անձնական տվյալների օգտագործման նպատակները։ Ընկերությունը կարող է օգտագործել Անձնական տվյալները հետևյալ նպատակների համար՝</p>
      <ul>
        <li>Ծառայությունները տրամադրելու նպատակով, ներառյալ Ծառայությունների (Կայքցի) օգտագործումը վերահսկելու համար,</li>
        <li>Օգտահաշիվը կառավարելու համար՝ իրականացնելով գրանցումը որպես Համակարգի օգտատեր,</li>
        <li>Օգտագործողի հետ կապ հաստատելու համար էլ. փոստով, հեռախոսազանգերով, կարճ հաղորդագրությամբ (SMS)-ով կամ էլեկտրոնային հաղորդակցության այլ համարժեք ձևերով, ինչպիսիք են օրինակ՝ Հավելվածների (push) ծանուցումները՝ գործառույթների, ապրանքների կամ պայմանագրային ծառայությունների թարմացումների հետ կապված տեղեկատվության փոխանցման համար, ներառյալ, անհրաժեշտության դեպքում, անվտանգության նկատառումներով իրականացվող թարմացումները,</li>
        <li>Օգտագործողի կողմից առաջարկվող ապրանքների, Ծառայությունների և իրադարձությունների մասին նորություններ, հատուկ առաջարկներ և ընդհանուր տեղեկություններ տրամադրելու համար,</li>
        <li>Ընկերությանը հասցեագրված հարցումներին պատասխանելու և դրանք կառավարելու համար,</li>
        <li>Այլ նպատակների համար. Տեղեկատվությունը կարող է օգտագործվել այլ նպատակների համար, ինչպիսիք են տվյալների վերլուծությունը, օգտագործման միտումների բացահայտումը, մեր գովազդային արշավների արդյունավետությունը որոշելու և Ծառայությունները, ինչպես նաև Ծառայություններից օգտվելու փորձը գնահատելու և այն բարելավելու համար։</li>
      </ul>

      <p>2.5 Անձնական տվյալների փոխանցումը։ Օգտագործողը տալիս է իր անձնական տվյալների փոխանցման անվերապահ իրավունք սույն գաղտնիության քաղաքականությամբ նախատեսված դեպքերում։ Անձնական տվյալները կարող են փոխանցվել հետևյալ դեպքերում՝</p>
      <ul>
        <li>Ընկերությանը ծառայություններ մատուցող անձանց՝ վերահսկելու և վերլուծելու Ծառայության օգտագործումը, ինչպես նաև Ձեզ հետ կապ հաստատելու համար,</li>
        <li>Ընկերության գործընկերներին՝ որոշ ապրանքներ, ծառայություններ կամ գովազդային առաջարկներ ներկայացնելու, վիճակագրական տվյալների կամ այլ նպատակների համար,</li>
        <li>Ձեր համաձայնությամբ մենք կարող ենք հանրայնացնել/փոխանցել Ձեր անձնական տվյալները ցանկացած այլ նպատակով։</li>
      </ul>

      <p>2.6 Անձնական տվյալների պահպանությունը։ Ընկերությունը պահպանում է Անձնական տվյալներն այնքան ժամանակ, որքան անհրաժեշտ է սույն Գաղտնիության քաղաքականությամբ սահմանված նպատակների իրականացման համար։ Անձնական տվյալներն կպահպանվեն և կօգտագործվեն այնքանով, որքանով դա անհրաժեշտ է «Անձնական տվյալների պաշտպանության մասին» ՀՀ օրենքով նախատեսված դեպքերում՝ Ընկերության պարտավորություններն իրականացնելու, վեճերը լուծելու և իրավական համաձայնագրերն ու քաղաքականությունը իրագործելու համար։</p>

      <p>2.7 Անձնական տվյալների մշակումը։ Անձնական տվյալները մշակվում են Ընկերության գործառնական գրասենյակներում և ցանկացած այլ վայրերում, որտեղ գտնվում են Անձնական տվյալների մշակման մեջ ներգրավված կողմերը։ Դա նշանակում է, որ այս տեղեկատվությունը կարող է փոխանցվել և պահպանվել համակարգիչների վրա, որոնք գտնվում են Ձեր երկրից, նահանգից կամ այլ իրավասությունից դուրս։ Տալով Ձեր համաձայնությունը սույն Գաղտնիության քաղաքականությանը՝ Դուք համաձայնվում եք այդ փոխանցմանը։ Ընկերությունը պարտավորվում է ձեռնարկել բոլոր անհրաժեշտ քայլերը՝ տվյալների անվտանգությունն ապահովելու համար և երաշխավորում է, որ տվյալները չեն փոխանցվի առանց պատշաճ վերահսկողության։</p>

      <p>2.8 Օգտագործողն իրավունք ունի ջնջելու/թարմացնելու կամ դիմելու Ընկերությանը՝ իր մասին հավաքագրված Անձնական տվյալները ջնջելու կամ թարմացնելու համար։ Օրենքով նախատեսված դեպքերում որոշ տեղեկատվություն կարող է չջնջվել։</p>

      <p>2.10 Անձնական տվյալների պաշտպանությունը։ Ընկերությունը երաշխավորում է, որ ձեռնարկում է բոլոր անհրաժեշտ միջոցները՝ տվյալների անվտանգությունը ապահովելու համար։ Սակայն ընկերությունը չի երաշխավորում դրանց բացարձակ անվտանգությունը։ Տվյալները պահվում են պաշտպանված ցանցերում, հասանելի են միայն սահմանափակ անձանց, որոնք ունեն հատուկ մուտքի իրավունքներ և պարտավոր են պահպանել գաղտնիությունը։ Ընկերությունը պատասխանատվություն չի կրում տվյալների արտահոսքի համար, եթե դա չի համապատասխանում օրենքին կամ սույն քաղաքականությանը։</p>

      <p>2.11 Կայքը կարող է պարունակել հղումներ այլ կայքերի, որոնք մենք չենք վերահսկում։ Այդ կայքերին անցնելիս մենք պատասխանատվություն չենք կրում այդ կայքերի գաղտնիության քաղաքականության համար։</p>

      <p>2.12 HTTP «cookies» տվյալների փոքր բլոկներ են, որոնք ստեղծվում են սերվերի կողմից՝ օգտագործողի կայքից օգտվելու ընթացքում։ Դրանք օգնում են կայքին ճանաչել բրաուզերը և հիշել որոշ տվյալներ, օրինակ՝ այցելությունների քանակը։</p>

      <h3>3. Սույն գաղտնիության քաղաքականության մեջ փոփոխությունների կատարումը</h3>
      <p>Գաղտնիության քաղաքականությունում փոփոխությունները և/կամ լրացումները կատարվում են Ընկերության կողմից միակողմանի։ Կատարված փոփոխությունները հրապարակվում են Կայքում։ Օգտագործողները համարվում են ծանուցված փոփոխությունների վերաբերյալ Կայքում հրապարակման պահից։</p>
    </div>
  );
}
